app/controllers/api/v1/category_controller.rb

            def index
                @catergories = current_user.categories.all
                @item ||=[]
                @catergories.each do |category|
---
SELECT `categories`.* FROM `categories`
SELECT `categories`.* FROM `categories` WHERE `categories`.`user_id` = 2

            def spinner_category
                @catergories = current_user.categories.all
                @catergoryData ||=[]
                @brandData ||= []
                @catergories.each do |category|
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`user_id` = 2

            def liston
                @catergories = Category.all
---
SELECT `categories`.* FROM `categories`

            def create
                category = current_user.categories.new(category_param)
                category.save
---
INSERT INTO `categories` (`name`, `attachment`, `user_id`, `created_at`, `updated_at`) VALUES ('Rokok', 'cigarettes.png', 2, '2019-10-02 12:09:23.690096', '2019-10-02 12:09:23.690096')