app/controllers/api/v1/category_controller.rb

            def create
                category = current_user.category.new(category_param)
                category.save
---
INSERT INTO `categories` (`name`, `attachment`, `user_id`, `created_at`, `updated_at`) VALUES ('rokok', '#<ActionDispatch::Http::UploadedFile:0x000000000c8241a8>', 1, '2019-09-17 05:31:36.931911', '2019-09-17 05:31:36.931911')