app/controllers/api/v1/item_controller.rb

      def index
        @products = current_user.items.all
        @item ||= []
        @products.each do |product|
          inventory = product.inventory
          data = { id:   product.id,
                   name: product.name_items,
                   url: "http://#{request.host}:#{request.port}#{ + product.product_picture_url}",
                   check_in: inventory.check_in,
                   stock: inventory.stock,
                   check_out: inventory.check_out,
                   variant: product.variant_sizes }
          @item.push(data)
---
SELECT `items`.* FROM `items` WHERE `items`.`user_id` = 2
INSERT INTO `items` (`category_id`, `price`, `product_picture`, `released_on`, `user_id`, `created_at`, `updated_at`, `check_in`, `check_out`, `stock`) VALUES (5, 16000, 'download.png', '2019-10-17', 2, '2019-10-17 16:20:40.987023', '2019-10-17 16:20:40.987023', 19, 0, 19)

      def create
        @param_i = param_inventory;
        @item = current_user.items.build(product_param)
        @variant = @item.variant_sizes.build(param_variant)
        @inventory = @item.build_inventory(param_inventory)
        @variant.inventories << @inventory
---
INSERT INTO `items` (`category_id`, `price`, `product_picture`, `released_on`, `user_id`, `created_at`, `updated_at`, `check_in`, `check_out`, `stock`) VALUES (5, 16000, 'download.png', '2019-10-17', 2, '2019-10-17 16:20:40.987023', '2019-10-17 16:20:40.987023', 19, 0, 19)