app/controllers/api/v1/login_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kusumajati51@gmail.com' LIMIT 1
---
            def create
                unless(params[:email] == nil || params[:email].empty?)
                    user = User.find_by!(email: params[:email])