app/controllers/api/v1/order_controller.rb

SELECT `items`.* FROM `items` WHERE `items`.`user_id` = 2 AND `items`.`id` = 2 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
INSERT INTO `orders` (`transaction_code`, `sold`, `price`, `item_id`, `user_id`, `created_at`, `updated_at`) VALUES ('10-24-2019-BY7N5R', 5, 80000, 2, 2, '2019-10-24 15:01:57.137195', '2019-10-24 15:01:57.137195')
---
      def create
        @items = current_user.items.find_by(id: params[:id])
        @variant = @items.variant_sizes.find_by(id: params[:variant_id])
        @sold = params[:sold]
        @price = @variant.sell_price.to_i * @sold.to_i
        @order = @items.order.new(sold: @sold.to_i, price: @price)
        if @order.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 4 LIMIT 1
INSERT INTO `orders` (`transaction_code`, `sold`, `price`, `item_id`, `user_id`, `created_at`, `updated_at`) VALUES ('10-26-2019-L0OG0A', 2, 32000, 4, 2, '2019-10-25 17:42:14.078661', '2019-10-25 17:42:14.078661')
---
      def multi_order
        @check_errors = []
        @items = current_user.items
        @param = multi_order_param
        @orders = []
        @param.each_with_index do |p, index|
           check_valid = {}
           item = @items.find(p[:id])
           variant_size = item.variant_sizes.find_by(id: p[:variant_id])
           sold = p[:sold]
           price = variant_size.sell_price.to_i - @sold.to_i
           order = item.order.new(sold: sold.to_i, price: price)
           @orders.push(order)