app/controllers/api/v1/product_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 3
INSERT INTO `items` (`name`, `category_id`, `price`, `product_picture`, `released_on`, `user_id`, `created_at`, `updated_at`, `check_in`, `check_out`, `stock`) VALUES ('rokok', 5, 16000, 'download.png', '2019-10-14', 2, '2019-10-14 07:30:56.107949', '2019-10-14 07:30:56.107949', 19, 0, 19)
---
            def index
                @products = current_user.product.all
                @item ||= []
                @products.each do |product|
                    data = {name: product.name,
                        price: product.price,
                        url: product.product_picture.url}
                    @item.push(data)

INSERT INTO `products` (`name`, `category_id`, `price`, `product_picture`, `released_on`, `user_id`, `created_at`, `updated_at`, `check_in`, `check_out`, `stock`) VALUES ('rokok', 5, 16000, 'download.png', '2019-10-13', 2, '2019-10-13 14:22:35.395336', '2019-10-13 14:22:35.395336', 19, 0, 19)
---
            def create
                @product = current_user.product.new(product_param)
                if @product.save