app/controllers/api/v1/register_controller.rb

      def create
        user = User.new(user_param)
        if user.save
---
INSERT INTO `users` (`email`, `password_digest`, `no_hp`, `name`, `created_at`, `updated_at`) VALUES ('tester11@tmail.com', '$2a$12$663bADb1wW2i91jX448vz.vdGrDmxkLA2dGRlvNkwpe7fiQAHVezO', '087787764186', 'Jati Kusuma', '2019-09-10 09:36:55.130367', '2019-09-10 09:36:55.130367')