app/controllers/api_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def current_user
        @current_user ||= User.find(payload['user_id'])